Revit 2027 API
ParameterTypeId.RebarSystemHookTypeFrontDirn1 Property
 "Exterior Major Hook Type"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RebarSystemHookTypeFrontDirn1 { get; }
Public Shared ReadOnly Property RebarSystemHookTypeFrontDirn1 As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RebarSystemHookTypeFrontDirn1 {
	ForgeTypeId^ get ();
}
static member RebarSystemHookTypeFrontDirn1 : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace